blog/2016-05-14-mac各种神器.org
#+TITLE: Mac各种神器
#+DATE: 2016-05-14
#+SETUPFILE: ~/myblog/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: Mac
#+JEKYLL_TAGS: Mac
#+JEKYLL_PUBLISHED: true

介绍了各种能提高Mac使用效率的神器




-----
- Alfred ::
  - 搜索神器，取代Mac自带的Spotlight，配置好能很大的提升效率

- Karabiner ::
  - 用来修改Mac键盘的布局
  - 特别是可以用来修改Vimer所喜欢的Fn+h/j/k/l为方向键

- Caffeine ::
  - 如果你想要快捷的改变苹果的省电（即保持亮屏）用这个软件就对了

- Amethyst ::
  - 如果你讨厌去调整各个窗口，喜欢用窗口管理的桌面的话
  - 这个软件可以自动调整窗口的大小，可能对于某些程序会有调整不准确的情况，不过还是很好用

- iterm ::
  - 替代Mac自带的终端，对于经常使用终端的人绝对是个神器

- flox ::
  - 用来代替迅雷下载的一个不错的软件，简单易用

- Homebrew ::
  - 相当与Linux下的各种包管理器，安装软件十分方便
  - 搜索：brew search mysql
  - 查询：brew info mysql 主要看具体的信息，比如目前的版本，依赖，安装后注意事项等
  - 更新：brew update 这会更新Homebrew
  - 检查是否有新版本：brew outdated 列出所有安装的软件里可以升级的那些
  - 升级：brew upgrade 升级所有可以升级的软件们
  - 清理：brew cleanup 清理不需要的版本极其安装包缓存

- Cheatsheet ::
  - 在程序下按 ⌘ 可以显示该程序的快捷键，提升效率的神器
    
- Blue Planet ::
  - 可以在你的桌面显示当前地球上的日照情况，十分酷炫

- The Unarchiver ::
  - 和系统的解压行为相同的解压软件，支持更多的压缩包类型

- Better touch tool ::
  - 可以增加更多的自定义手势，增加触摸版的功能

- Dash ::
  - 开发人员的神器，可以快速的查看API

- 欧路词典 ::
  - 分分钟秒有道词典的词典，可以添加自定义词典，同时支持划词操作

- Bartender ::
  - 管理Mac状态栏的图标，可以折叠比较少用的图标以及调整图标的位置

- iStat Menus ::
  - 实时在状态栏显示系统的详细状态，十分好用，就是有点贵
