_posts/2016-05-14-mac各种神器.html
---
title: "Mac各种神器"
date: 2016-05-14
layout: post
categories: 
- Mac
tags: 
- Mac 
- 提升效率神器
published: true
comments: 
---
<p>
介绍了各种能提高Mac使用效率的神器
</p>




<hr  />
<dl class="org-dl">
<dt>Alfred</dt><dd><ul class="org-ul">
<li>搜索神器，取代Mac自带的Spotlight，配置好能很大的提升效率</li>
</ul></dd>

<dt>Karabiner</dt><dd><ul class="org-ul">
<li>用来修改Mac键盘的布局</li>
<li>特别是可以用来修改Vimer所喜欢的Fn+h/j/k/l为方向键</li>
</ul></dd>

<dt>Caffeine</dt><dd><ul class="org-ul">
<li>如果你想要快捷的改变苹果的省电（即保持亮屏）用这个软件就对了</li>
</ul></dd>

<dt>Amethyst</dt><dd><ul class="org-ul">
<li>如果你讨厌去调整各个窗口，喜欢用窗口管理的桌面的话</li>
<li>这个软件可以自动调整窗口的大小，可能对于某些程序会有调整不准确的情况，不过还是很好用</li>
</ul></dd>

<dt>iterm</dt><dd><ul class="org-ul">
<li>替代Mac自带的终端，对于经常使用终端的人绝对是个神器</li>
</ul></dd>

<dt>flox</dt><dd><ul class="org-ul">
<li>用来代替迅雷下载的一个不错的软件，简单易用</li>
</ul></dd>

<dt>Homebrew</dt><dd><ul class="org-ul">
<li>相当与Linux下的各种包管理器，安装软件十分方便</li>
<li>搜索：brew search mysql</li>
<li>查询：brew info mysql 主要看具体的信息，比如目前的版本，依赖，安装后注意事项等</li>
<li>更新：brew update 这会更新Homebrew</li>
<li>检查是否有新版本：brew outdated 列出所有安装的软件里可以升级的那些</li>
<li>升级：brew upgrade 升级所有可以升级的软件们</li>
<li>清理：brew cleanup 清理不需要的版本极其安装包缓存</li>
</ul></dd>

<dt>Cheatsheet</dt><dd><ul class="org-ul">
<li>在程序下按 ⌘ 可以显示该程序的快捷键，提升效率的神器</li>
</ul></dd>

<dt>Blue Planet</dt><dd><ul class="org-ul">
<li>可以在你的桌面显示当前地球上的日照情况，十分酷炫</li>
</ul></dd>

<dt>The Unarchiver</dt><dd><ul class="org-ul">
<li>和系统的解压行为相同的解压软件，支持更多的压缩包类型</li>
</ul></dd>

<dt>Better touch tool</dt><dd><ul class="org-ul">
<li>可以增加更多的自定义手势，增加触摸版的功能</li>
</ul></dd>

<dt>Dash</dt><dd><ul class="org-ul">
<li>开发人员的神器，可以快速的查看API</li>
</ul></dd>

<dt>欧路词典</dt><dd><ul class="org-ul">
<li>分分钟秒有道词典的词典，可以添加自定义词典，同时支持划词操作</li>
</ul></dd>

<dt>Bartender</dt><dd><ul class="org-ul">
<li>管理Mac状态栏的图标，可以折叠比较少用的图标以及调整图标的位置</li>
</ul></dd>

<dt>iStat Menus</dt><dd><ul class="org-ul">
<li>实时在状态栏显示系统的详细状态，十分好用，就是有点贵</li>
</ul></dd>
</dl>
